app/controllers/articles_controller.rb

  def index
    @title = "Listagem de Artigos"
    @articles = Article.all
---
SELECT "articles".* FROM "articles"

  def show
    begin
      @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    begin
      @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?)  [["title", "Artigo da Claine"], ["body", "Corpo da claine"], ["created_at", "2022-10-01 03:05:28.386466"], ["updated_at", "2022-10-01 03:05:28.386466"], ["category_id", 3]]

    def set_categories
      @categories = Category.all.order(:name)
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC