app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
    def index
      @title = "Listagem de Categorias"
      @categories = Category.all

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
    begin
        @category = Category.find(params[:id])

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
    begin
        @category = Category.find(params[:id])

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Categoria 1"], ["updated_at", "2022-10-01 01:51:04.232009"], ["id", 1]]
---
    def update
    @category = Category.find(params[:id])

    if @category.update(category_params)